---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.Pipe.FlowState
zh: 管道、水管、管线
source: html/fbd5a1a8-86ad-45a3-4099-01bc54ad99e1.htm
---
# Autodesk.Revit.DB.Plumbing.Pipe.FlowState Property

**中文**: 管道、水管、管线

The flow state of the pipe.

## Syntax (C#)
```csharp
public PipeFlowState FlowState { get; }
```